tests/load/create-streams.yml
config:
  target: "http://localhost:3001"
  phases:
    - name: create-streams-50-concurrent
      duration: 60
      arrivalRate: 50
      maxVusers: 50
  defaults:
    headers:
      Content-Type: application/json
  plugins:
    ensure: {}
    metrics-by-endpoint: {}
  ensure:
    thresholds:
      - http.response_time.p99: 2000
scenarios:
  - name: create-stream
    flow:
      - post:
          url: "/test/concurrent-tx"
          json: {}